nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_cadc.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dsc_cadc"
#endif

/*
 * Define the MACROs to help calculating the position of register field from sample index.
 */
/* ADC_ZXCTRL1 & ADC_ZXCTRL2. */
#define ADC_ZXCTRL_ZCE_MASK(u16SampleIndex) (uint16_t)(3UL << (2U * ((uint16_t)(u16SampleIndex))))
#define ADC_ZXCTRL_ZCE(u16SampleIndex, u16Value) \
    (uint16_t)(((uint16_t)(u16Value)) << (2U * ((uint16_t)(u16SampleIndex))))

/* ADC_CLIST1 & ADC_CLIST2 & ADC_CLIST3 & ADC_CLIST4 */
#define ADC_CLIST_SAMPLE_MASK(u16SampleIndex) (uint16_t)(0xFUL << (4U * ((uint16_t)(u16SampleIndex))))
#define ADC_CLIST_SAMPLE(u16SampleIndex, u16Value) \
    (uint16_t)(((uint16_t)(u16Value)) << (4U * ((uint16_t)(u16SampleIndex))))

/* ADC_GC1 & ADC_GC2. */
#define ADC_GC_GAIN_MASK(u16SampleIndex) (uint16_t)(0x3UL << (2U * ((uint16_t)(u16SampleIndex))))
#define ADC_GC_GAIN(u16SampleIndex, u16Value) (uint16_t)(((uint16_t)(u16Value)) << (2U * ((uint16_t)(u16SampleIndex))))

#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
#define ZXCTRL3_ADDRESS (volatile uint16_t *)&(base->ZXCTRL3)
#else
#define ZXCTRL3_ADDRESS NULL
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
#define ADC_ZXCTRL_REG_ADDRESS_ARRAY                                                              \
    {                                                                                             \
        (volatile uint16_t *)&base->ZXCTRL1, (volatile uint16_t *)&base->ZXCTRL2, ZXCTRL3_ADDRESS \
    }

#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
#define CLIST5_ADDRESS (volatile uint16_t *)&base->CLIST5
#else
#define CLIST5_ADDRESS NULL
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
#define ADC_CLIST_REG_ADDRESS_ARRAY                                                                                 \
    {                                                                                                               \
        (volatile uint16_t *)&base->CLIST1, (volatile uint16_t *)&base->CLIST2, (volatile uint16_t *)&base->CLIST3, \
            (volatile uint16_t *)&base->CLIST4, CLIST5_ADDRESS,                                                     \
    }

#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
#define GC3_ADDRESS (volatile uint16_t *)&base->GC3
#else
#define GC3_ADDRESS NULL
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
#define GC3_REG_INDEX 2U
#define ADC_GC_REG_ADDRESS_ARRAY                                                      \
    {                                                                                 \
        (volatile uint16_t *)&base->GC1, (volatile uint16_t *)&base->GC2, GC3_ADDRESS \
    }

/*!
 * @brief The enumeration of channel mode type.
 */
typedef enum _cadc_channel_mode_type
{
    kCADC_SingleEndType = 1U,         /*!< The channel configured as Single-End mode. In this operate mode the ADC
                                          measures the voltage of the selected analog input and compare it against
                                          the reference voltage range. */
    kCADC_FullyDifferentialType = 2U, /*!< The channel configured as fully differential mode. In this operate mode
                                          the ADC measures the voltage difference between two analog inputs and
                                          compare that value against the reference voltage range. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_UnipolarDifferentType = 3U, /*!< The channel configured as Unipolar differential mode. In this operate
                                          mode, the conversions are only positive but uses the full code range of
                                          the ADC. */
#endif                                /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_EvenChannelAltSourceOddChannelNormal = 4U, /*!< The Even channel configured as alternate source, the Odd
                                                        channel configured as Normal single-end operate mode.  */
    kCADC_EvenChannelNormalOddChannelAltSource = 5U, /*!< The Even channel configured as Normal single-end operate mode,
                                                         the Odd channel configured as alternate source.  */
    kCADC_EvenChannelAltSourceOddChannelAltSource = 6U, /*!< The Even channel configured as alternate source,
                                                           the Odd channel configured as alternate source.  */
#endif                                                  /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_channel_mode_type_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Get instance number for CADC module.
 *
 * @param base CADC peripheral base address
 */
static uint32_t CADC_GetInstance(ADC_Type *base);

/*!
 * @brief Calculates the channel index from the channel mode.
 *
 * @param eChannelMode Please refer to @ref cadc_channel_mode_t for details.
 */
static uint16_t CADC_CalculateChannelIndexViaChannelMode(cadc_channel_mode_t eChannelMode);

/*!
 * @brief Configures the converter A, such as clock divisor, reference voltage and so on.
 *
 * This function is to configure the converter A with converter configuration structure. As the control register bits
 * for converter A and B are not in the same order, the configuring functions are also implemented for each.
 *
 * @param base   CADC peripheral base address.
 * @param psConfig Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
static void CADC_SetConverterAConfig(ADC_Type *base, const cadc_converter_config_t *psConfig);

/*!
 * @brief Configures the converter B, such as clock divisor, reference voltage and so on
 *
 * This function is to configure the converter B with converter configuration structure. As the control register bits
 * for converter A and B are not in the same order, the configuring functions are also implemented for each.
 *
 * @param base   CADC peripheral base address.
 * @param psConfig Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
static void CADC_SetConverterBConfig(ADC_Type *base, const cadc_converter_config_t *psConfig);

