nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.c
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to CADC bases for each instance. */
static ADC_Type *const s_cadcBases[] = ADC_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to CADC clocks for each instance. */
static const clock_ip_name_t s_cadcClocks[] = CADC_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t CADC_GetInstance(ADC_Type *base)
{
    uint32_t u32Instance;

    /* Find the instance index from base address mappings. */
    for (u32Instance = 0; u32Instance < ARRAY_SIZE(s_cadcBases); u32Instance++)
    {
        if (s_cadcBases[u32Instance] == base)
        {
            break;
        }
    }

    assert(u32Instance < ARRAY_SIZE(s_cadcBases));

    return u32Instance;
}

static void CADC_SetConverterAConfig(ADC_Type *base, const cadc_converter_config_t *psConfig)
{
    assert(NULL != psConfig);

    uint16_t u16Tmp;

    /* ADC_CTRL2. */
    u16Tmp = base->CTRL2 & ~(uint16_t)(ADC_CTRL2_DIV0_MASK);
    u16Tmp |= ADC_CTRL2_DIV0(psConfig->u16ClockDivisor);
    base->CTRL2 = u16Tmp;

    /* ADC_CAL. */
    u16Tmp = base->CAL & ~(uint16_t)(ADC_CAL_SEL_VREFH_A_MASK | ADC_CAL_SEL_VREFLO_A_MASK);
    if (kCADC_ReferenceVoltageChannelPad == psConfig->eHighReferenceVoltageSource)
    {
        u16Tmp |= ADC_CAL_SEL_VREFH_A_MASK;
    }
    if (kCADC_ReferenceVoltageChannelPad == psConfig->eLowReferenceVoltageSource)
    {
        u16Tmp |= ADC_CAL_SEL_VREFLO_A_MASK;
    }
    base->CAL = u16Tmp;

#if !(defined(FSL_FEATURE_CADC_NO_SPEEDMODE_BIT) && FSL_FEATURE_CADC_NO_SPEEDMODE_BIT)
    /* ADC_PWR2. */
    u16Tmp = base->PWR2 & ~(uint16_t)(ADC_PWR2_SPEEDA_MASK);
    u16Tmp |= ADC_PWR2_SPEEDA((uint16_t)(psConfig->eSpeedMode));
    base->PWR2 = u16Tmp;
#endif /* FSL_FEATURE_CADC_NO_SPEEDMODE_BIT */

#if !(defined(FSL_FEATURE_CADC_NO_SAMPLE_WINDOW) && FSL_FEATURE_CADC_NO_SAMPLE_WINDOW)
    /* ADC_CTRL3. */
    u16Tmp = base->CTRL3 & ~(uint16_t)(ADC_CTRL3_SCNT0_MASK);
    u16Tmp |= ADC_CTRL3_SCNT0(psConfig->u16SampleWindowCount);
    base->CTRL3 = u16Tmp;
#endif /* FSL_FEATURE_CADC_NO_SAMPLE_WINDOW */

    /* Enable/Disabled DMA of converter A. */
    if (psConfig->bEnableDMA)
    {
        base->CTRL1 |= ADC_CTRL1_DMAEN0_MASK;
    }
    else
    {
        base->CTRL1 &= ~ADC_CTRL1_DMAEN0_MASK;
    }

    if (psConfig->bScanInitBySync)
    {
        base->CTRL1 |= ADC_CTRL1_SYNC0_MASK;
    }
    else
    {
        base->CTRL1 &= ~ADC_CTRL1_SYNC0_MASK;
    }

    /* Power up/down the converter. */
    CADC_EnableConverterPower(base, kCADC_ConverterA, psConfig->bPowerUp);
    CADC_EnableConverter(base, kCADC_ConverterA, psConfig->bPowerUp);
}

static void CADC_SetConverterBConfig(ADC_Type *base, const cadc_converter_config_t *psConfig)
{
    assert(NULL != psConfig);

    uint16_t u16Tmp;

    /* ADC_CAL. */
    u16Tmp = base->CAL & ~(uint16_t)(ADC_CAL_SEL_VREFH_B_MASK | ADC_CAL_SEL_VREFLO_B_MASK);
    if (kCADC_ReferenceVoltageChannelPad == psConfig->eHighReferenceVoltageSource)
    {
        u16Tmp |= ADC_CAL_SEL_VREFH_B_MASK;
    }
    if (kCADC_ReferenceVoltageChannelPad == psConfig->eLowReferenceVoltageSource)
    {
        u16Tmp |= ADC_CAL_SEL_VREFLO_B_MASK;
    }
    base->CAL = u16Tmp;

#if !(defined(FSL_FEATURE_CADC_NO_SPEEDMODE_BIT) && FSL_FEATURE_CADC_NO_SPEEDMODE_BIT)
    /* ADC_PWR2. */
    u16Tmp = base->PWR2 & ~(uint16_t)(ADC_PWR2_DIV1_MASK | ADC_PWR2_SPEEDB_MASK);
    u16Tmp |= ADC_PWR2_DIV1(psConfig->u16ClockDivisor) | ADC_PWR2_SPEEDB((uint16_t)(psConfig->eSpeedMode));
    base->PWR2 = u16Tmp;
#else
    u16Tmp = base->PWR2 & (~ADC_PWR2_DIV1_MASK);
    u16Tmp |= ADC_PWR2_DIV1(psConfig->u16ClockDivisor);
    base->PWR2 = u16Tmp;
#endif /* FSL_FEATURE_CADC_NO_SPEEDMODE_BIT */

#if !(defined(FSL_FEATURE_CADC_NO_SAMPLE_WINDOW) && FSL_FEATURE_CADC_NO_SAMPLE_WINDOW)
    /* ADC_CTRL3. */
    u16Tmp = base->CTRL3 & ~(uint16_t)(ADC_CTRL3_SCNT1_MASK);
    u16Tmp |= ADC_CTRL3_SCNT1(psConfig->u16SampleWindowCount);
    base->CTRL3 = u16Tmp;
#endif /* FSL_FEATURE_CADC_NO_SAMPLE_WINDOW */

    if (psConfig->bEnableDMA)
    {
        base->CTRL2 |= ADC_CTRL2_DMAEN1_MASK;
    }
    else
    {
        base->CTRL2 &= ~(uint16_t)ADC_CTRL2_DMAEN1_MASK;
    }

    if (psConfig->bScanInitBySync)
    {
        base->CTRL2 |= ADC_CTRL2_SYNC1_MASK;
    }
    else
    {
        base->CTRL2 &= (uint16_t)~ADC_CTRL2_SYNC1_MASK;
    }

    /* Power up/down the converter. */
    CADC_EnableConverterPower(base, kCADC_ConverterB, psConfig->bPowerUp);
    CADC_EnableConverter(base, kCADC_ConverterB, psConfig->bPowerUp);
}

static uint16_t CADC_CalculateChannelIndexViaChannelMode(cadc_channel_mode_t eChannelMode)
{
    uint16_t u16Index                            = 0U;
    cadc_channel_mode_type_t eMaxChannelModeType = kCADC_FullyDifferentialType;
    uint32_t u32TempChannelMode                  = (uint32_t)eChannelMode;

    /* Sets the maximum change mode of the channel. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    eMaxChannelModeType = kCADC_UnipolarDifferentType;
#endif /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    if ((u32TempChannelMode >= (uint32_t)kCADC_ANA6_InternalTempSensor_ANA7_Normal &&
         u32TempChannelMode <= (uint32_t)kCADC_ANA6_InternalTempSensor_ANA7_InternalAnalogInput) ||
        (u32TempChannelMode >= (uint32_t)kCADC_ANB6_InternalTempSensor_ANB7_Normal &&
         u32TempChannelMode <= (uint32_t)kCADC_ANB6_InternalTempSensor_ANB7_InternalAnalogInput))
    {
        eMaxChannelModeType = kCADC_EvenChannelAltSourceOddChannelAltSource;
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */

    /* Gets the channel's offset  */
    while (u32TempChannelMode > (uint32_t)eMaxChannelModeType)
    {
        u32TempChannelMode = u32TempChannelMode >> 1U;
        u16Index++;
    }

    return u16Index;
}

/*!
 * brief Initializes the CADC module, such as scan mode, DMA trigger source, interrupt mask and so on.
 *
 * This function is to make the initialization for using CADC module.
 * The operations are:
 *  - Enable the clock for CADC.
 *  - Set power up delay and Idle work mode.
 *  - Set DMA trigger source.
 *  - Enable the interrupts(Including High/Low limit interrupt, zero crossing interrupt interrupt, end of scan interrupt
 *    and each sample slot's scan interrupt).
 *  - Set scan mode.
 *  - Set disabled sample slot for the scan.
 *  - Set scan control options.
 *  - Set selected channels' mode.
 *  - Set gain for each channel.
 *  - Config conterA and converterB.
 *
 * param base   CADC peripheral base address.
 * param psConfig Pointer to configuration structure. See @ref cadc_config_t.
 */
void CADC_Init(ADC_Type *base, const cadc_config_t *psConfig)
{
    assert(psConfig != NULL);

    uint16_t u16Tmp;
    uint8_t u8Index;
    uint32_t u32Tmp;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enables Clock. */
    CLOCK_EnableClock(s_cadcClocks[CADC_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* 1. Sets Common options. */
    /*1.1 Sets power up delay and Idle work mode.  */
#if !(defined(FSL_FEATURE_CADC_NO_AUTO_STANDBY) && FSL_FEATURE_CADC_NO_AUTO_STANDBY)
    /* ADC_PWR. */
    u16Tmp = (uint16_t)(base->PWR & ~(ADC_PWR_ASB_MASK | ADC_PWR_PUDELAY_MASK | ADC_PWR_APD_MASK));
#else
    u16Tmp     = (uint16_t)(base->PWR & ~(ADC_PWR_PUDELAY_MASK | ADC_PWR_APD_MASK));
#endif /* FSL_FEATURE_CADC_NO_AUTO_STANDBY */

    u16Tmp |= ADC_PWR_PUDELAY(psConfig->u16PowerUpDelay);
#if !(defined(FSL_FEATURE_CADC_NO_AUTO_STANDBY) && FSL_FEATURE_CADC_NO_AUTO_STANDBY)
    if (kCADC_IdleAutoStandby == psConfig->eIdleWorkMode)
    {
        u16Tmp |= ADC_PWR_ASB_MASK;
    }
    else if (kCADC_IdleAutoPowerDown == psConfig->eIdleWorkMode)
#else
    if (kCADC_IdleAutoPowerDown == psConfig->eIdleWorkMode)
#endif /* FSL_FEATURE_CADC_NO_AUTO_STANDBY */
    {
        u16Tmp |= ADC_PWR_APD_MASK;
    }
    else
    {
        /* To avoid MISRA rule 14.10 error. */
    }
    base->PWR = u16Tmp;
    /* 1.2 Configs DMA Trigger Source. */
    if (kCADC_DMATrigSrcSampleReady == psConfig->eDMATriggerSource)
    {
        base->CTRL3 |= ADC_CTRL3_DMASRC_MASK;
    }
    else /* kCADCDmaTriggerSourceAsEndOfScan. */
    {
        base->CTRL3 &= ~(uint16_t)ADC_CTRL3_DMASRC_MASK;
    }
    /* 1.3 Enables the interrupts. */
    CADC_EnableInterrupts(base, psConfig->u32EnabledInterruptMask);

    /* 2. Configs Scan related options. */
    /* 2.1 Sets current Scan mode. */
    CADC_SetScanMode(base, psConfig->eScanMode);
    /* 2.2 Sets disabled sample slot for the scan. */
    if ((psConfig->eScanMode == kCADC_ScanModeOnceParallelIndependent) ||
        (psConfig->eScanMode == kCADC_ScanModeLoopParallelIndependent) ||
        (psConfig->eScanMode == kCADC_ScanModeTriggeredParallelIndependent))
    {
        base->SDIS =
            (uint16_t)((psConfig->uDisabledSampleSlot.u32SampleDisVal & 0xFFU) |
                       (uint16_t)((uint32_t)(psConfig->uDisabledSampleSlot.u32SampleDisVal & 0xFF0000UL) >> 8UL));
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
        base->SDIS2 = ((psConfig->uDisabledSampleSlot.u32SampleDisVal & 0x300UL) >> 8U) |
                      ((psConfig->uDisabledSampleSlot.u32SampleDisVal & 0xC000000UL) >> 24U);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
    }
    else
    {
        base->SDIS = (psConfig->uDisabledSampleSlot.u32SampleDisVal & 0xFFFFUL);
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
        base->SDIS2 = (psConfig->uDisabledSampleSlot.u32SampleDisVal & 0xF0000UL) >> 16UL;
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
    }
    /* 2.3 Sets which samples will delay until a new sync input occurs. */
    CADC_SetScanControl(base, psConfig->uScanControl);

