nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.c
    /* 3. Configs Channel related options. */
    for (u8Index = 0U; u8Index < 8U; u8Index++)
    {
        u32Tmp = (uint32_t)((psConfig->u32ChannelModeMask) & (0x7UL << (3UL * (uint32_t)u8Index)));
        if (u32Tmp != 0UL)
        {
            CADC_SetChannelMode(base, (cadc_channel_mode_t)(u32Tmp));
        }
    }
    for (u8Index = 0U; u8Index < CADC_SAMPLE_SLOTS_COUNT; u8Index++)
    {
        CADC_SetChannelGain(base, (cadc_channel_number_t)u8Index, psConfig->eChannelGain[u8Index]);
        CADC_RouteChannelToSampleSlot(base, (cadc_sample_slot_index_t)u8Index, psConfig->eSampleSlot[u8Index]);
    }

    /* 4. Configs conveters related options. */
    CADC_SetConverterConfig(base, kCADC_ConverterA, &(psConfig->sConverterA));
    CADC_SetConverterConfig(base, kCADC_ConverterB, &(psConfig->sConverterB));
}

/*!
 * brief Gets an available pre-defined options(such as scan mode, DMA trigger source, interrupt mask and so on) for
 * module's configuration.
 *
 * This function initializes the module's configuration structure with an available settings.
 * The default value are:
 * code
 *   psConfig->eDMATriggerSource = kCADC_DMATrigSrcEndofScan;
 *   psConfig->eIdleWorkMode = kCADC_IdleKeepNormal;
 *   psConfig->u16PowerUpDelay = 26U;
 *   psConfig->u32EnabledInterruptMask = 0U;
 *   psConfig->eScanMode = kCADC_ScanModeTriggeredParallelSimultaneous;
 *   psConfig->uDisabledSampleSlot.u32SampleDisVal = 0xFF0F0UL;
 *   psConfig->uScanControl.u32ScanCtrlVal         = 0x0UL;
 *   psConfig->eChannelGain[x] = kCADC_SignalGainX1;
 *   psConfig->sampleSlotScanInterruptEnableMask = kCADC_NonSampleSlotMask;
 *   For the default setting of converter, please see CADC_GetConverterDefaultConfig().
 * endcode
 *
 * param psConfig Pointer to configuration structure. See @ref cadc_config_t.
 */
void CADC_GetDefaultConfig(cadc_config_t *psConfig)
{
    assert(NULL != psConfig);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    psConfig->eIdleWorkMode           = kCADC_IdleKeepNormal;
    psConfig->eDMATriggerSource       = kCADC_DMATrigSrcEndofScan;
    psConfig->u16PowerUpDelay         = 26U;
    psConfig->u32EnabledInterruptMask = 0UL; /* Do not enable any interrupts. */

    /* Scan related options. */
    psConfig->eScanMode                           = kCADC_ScanModeTriggeredParallelSimultaneous;
    psConfig->uDisabledSampleSlot.u32SampleDisVal = 0xFF0F0UL;
    psConfig->uScanControl.u32ScanCtrlVal         = 0x0UL;

    /* Channel related options. */
    psConfig->u32ChannelModeMask = kCADC_ANA0_1_SingleEnd | kCADC_ANA2_3_SingleEnd | kCADC_ANA4_5_SingleEnd |
                                   kCADC_ANA6_7_SingleEnd | kCADC_ANB0_1_SingleEnd | kCADC_ANB2_3_SingleEnd |
                                   kCADC_ANB4_5_SingleEnd | kCADC_ANB6_7_SingleEnd;
    for (uint8_t u8Index = 0U; u8Index < CADC_SAMPLE_SLOTS_COUNT; u8Index++)
    {
        psConfig->eChannelGain[u8Index] = kCADC_SignalGainX1;
        psConfig->eSampleSlot[u8Index]  = (cadc_channel_number_t)u8Index;
    }

    /* Converters related options. */
    CADC_GetConverterDefaultConfig(&(psConfig->sConverterA));
    CADC_GetConverterDefaultConfig(&(psConfig->sConverterB));
}

/*!
 * brief De-initializes the CADC module, including power down both converter and disable the clock(Optional).
 *
 * This function is to make the de-initialization for using CADC module.
 * The operations are:
 *  - Power down both converter.
 *  - Disable the clock for CADC.
 *
 * param base CADC peripheral base address.
 */
void CADC_Deinit(ADC_Type *base)
{
    /* Stop both converter. */
    CADC_EnableConverter(base, kCADC_ConverterA, false);
    CADC_EnableConverter(base, kCADC_ConverterB, false);

    /* Power done both converter. */
    CADC_EnableConverterPower(base, kCADC_ConverterA, false);
    CADC_EnableConverterPower(base, kCADC_ConverterB, false);
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable the clock. */
    CLOCK_DisableClock(s_cadcClocks[CADC_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Sets mode for the specific channel(Each channel can be set as single-end, fully differential and unipolar
 * differential(Optional) mode).
 *
 * param base CADC peripheral base address.
 * param eChannelMode The channel mode to be set, please refer to @ref cadc_channel_mode_t for details.
 */
void CADC_SetChannelMode(ADC_Type *base, cadc_channel_mode_t eChannelMode)
{
    uint16_t u16ChannelIndex  = 0U;
    uint16_t u16ChannelOffset = 0U;
    uint8_t u8CtrlRegIndex    = 0U;

    /* Gets the index from channel mode */
    u16ChannelIndex = CADC_CalculateChannelIndexViaChannelMode(eChannelMode);

    /* Gets the offset of the specific channel in the Channel configure bit field */
    u16ChannelOffset = 1U << (u16ChannelIndex / 3U);
    u8CtrlRegIndex   = (u16ChannelOffset > 8U) ? 1U : 0U;

    switch ((cadc_channel_mode_type_t)((uint32_t)eChannelMode >> u16ChannelIndex))
    {
        case kCADC_SingleEndType:
        {
            if (u8CtrlRegIndex == 0U)
            {
                base->CTRL1 &= ~ADC_CTRL1_CHNCFG_L(u16ChannelOffset & 0xFU);
            }
            else
            {
                base->CTRL2 &= ~ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
                if (eChannelMode == kCADC_ANA6_7_SingleEnd)
                {
                    base->CLIST5 &= ~(ADC_CLIST5_SEL_TEMP_0_MASK | ADC_CLIST5_SEL_INTERNAL_0_MASK);
                }
                else if (eChannelMode == kCADC_ANB6_7_SingleEnd)
                {
                    base->CLIST5 &= ~(ADC_CLIST5_SEL_TEMP_1_MASK | ADC_CLIST5_SEL_INTERNAL_1_MASK);
                }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
            }
            break;
        }
        case kCADC_FullyDifferentialType:
        {
            if (u8CtrlRegIndex == 0U)
            {
                base->CTRL1 |= ADC_CTRL1_CHNCFG_L(u16ChannelOffset & 0xFU);
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
                base->CTRL3 &= ~ADC_CTRL3_UPDEN_L(u16ChannelOffset & 0xFU);
#endif /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
            }
            else
            {
                base->CTRL2 |= ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
                base->CTRL3 &= ~ADC_CTRL3_UPDEN_H((u16ChannelOffset & 0xF0U) >> 4U);
#endif /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
            }
            break;
        }
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
        case kCADC_UnipolarDifferentType:
        {
            if (u8CtrlRegIndex == 0U)
            {
                base->CTRL1 |= ADC_CTRL1_CHNCFG_L(u16ChannelOffset & 0xFU);
                base->CTRL3 |= ADC_CTRL3_UPDEN_L(u16ChannelOffset & 0xFU);
            }
            else
            {
                base->CTRL2 |= ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
                base->CTRL3 |= ADC_CTRL3_UPDEN_H((u16ChannelOffset & 0xF0U) >> 4U);
            }
            break;
        }
#endif /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
        case kCADC_EvenChannelAltSourceOddChannelNormal:
        {
            base->CTRL2 &= ~ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
            if (eChannelMode == kCADC_ANA6_InternalTempSensor_ANA7_Normal)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_TEMP_0_MASK;
                base->CLIST5 &= ~ADC_CLIST5_SEL_INTERNAL_0_MASK;
            }
            else if (eChannelMode == kCADC_ANB6_InternalTempSensor_ANB7_Normal)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_TEMP_1_MASK;
                base->CLIST5 &= ~ADC_CLIST5_SEL_INTERNAL_1_MASK;
            }
            break;
        }
        case kCADC_EvenChannelNormalOddChannelAltSource:
        {
            base->CTRL2 &= ~ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
            if (eChannelMode == kCADC_ANA6_Normal_ANA7_InternalAnalogInput)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_INTERNAL_0_MASK;
                base->CLIST5 &= ~ADC_CLIST5_SEL_TEMP_0_MASK;
            }
            else if (eChannelMode == kCADC_ANB6_Normal_ANB7_InternalAnalogInput)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_INTERNAL_1_MASK;
                base->CLIST5 &= ~ADC_CLIST5_SEL_TEMP_1_MASK;
            }
            break;
        }
        case kCADC_EvenChannelAltSourceOddChannelAltSource:
        {
            base->CTRL2 &= ~ADC_CTRL2_CHNCFG_H((u16ChannelOffset & 0xF0U) >> 4U);
            if (eChannelMode == kCADC_ANA6_InternalTempSensor_ANA7_InternalAnalogInput)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_INTERNAL_0_MASK;
                base->CLIST5 |= ADC_CLIST5_SEL_TEMP_0_MASK;
            }
            else if (eChannelMode == kCADC_ANB6_InternalTempSensor_ANB7_InternalAnalogInput)
            {
                base->CLIST5 |= ADC_CLIST5_SEL_INTERNAL_1_MASK;
                base->CLIST5 |= ADC_CLIST5_SEL_TEMP_1_MASK;
            }
            break;
        }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
        default:
        {
            /* This branch should never be hit. */
            break;
        }
    }
}

/*!
 * brief Sets the gain(Supports X1, X2, X4) of selected channel.
 *
 * param base CADC peripheral base address.
 * param eChannelNumber The number of channel, please refer to @ref cadc_channel_number_t.
 * param eChannelGain The gain amplification, please refer to @ref cadc_channel_gain_t for details.
 */
void CADC_SetChannelGain(ADC_Type *base, cadc_channel_number_t eChannelNumber, cadc_channel_gain_t eChannelGain)
{
    volatile uint16_t *pGcRegAddrArray[] = ADC_GC_REG_ADDRESS_ARRAY;
    uint16_t u16Tmp                      = 0U;
    volatile uint16_t *pGcRegPtr         = NULL;

    pGcRegPtr = pGcRegAddrArray[eChannelNumber / 8U];
    if (pGcRegPtr != NULL)
    {
        u16Tmp = (*pGcRegPtr) & (uint16_t)(~ADC_GC_GAIN_MASK(eChannelNumber & 7U));
        u16Tmp |= ADC_GC_GAIN(eChannelNumber & 7U, (uint16_t)eChannelGain);
        (*pGcRegPtr) = u16Tmp;
    }
}

/*!
 * brief Gets sample slot default configuration including zero crossing mode, high limit value, low limit value and
 * offset value.
 *
 * code
 *      psConfig->eZeroCrossingMode = kCADC_ZeroCrossingDisabled;
 *      psConfig->u16HighLimitValue  = 0x7FF8U;
 *      psConfig->u16LowLimitValue   = 0x0U;
 *      psConfig->u16OffsetValue     = 0x0U;
 * endcode
 *
 * param psConfig      Pointer to configuration structure. See @ref cadc_sample_slot_config_t.
 */
void CADC_GetSampleSlotDefaultConfig(cadc_sample_slot_config_t *psConfig)
{
    assert(psConfig != NULL);

    psConfig->eZeroCrossingMode = kCADC_ZeroCrossingDisabled;
    psConfig->u16HighLimitValue = 0x7FF8U;
    psConfig->u16LowLimitValue  = 0x0U;
    psConfig->u16OffsetValue    = 0x0U;
}

/*!
 * brief Configures the options(including zero crossing mode, high limit value, low limit value and offset value) for
 * sample slot.
 *
 * note This function can be used to set high limit value, low limit value,
 * offset value and zerocrossing mode of the sample slot.
 *
 * param base        CADC peripheral base address.
 * param eSampleIndex Index of sample slot in conversion sequence. Please refer to @ref cadc_sample_slot_index_t.
 * param psConfig      Pointer to configuration structure. See @ref cadc_sample_slot_config_t.
 */
void CADC_SetSampleSlotConfig(ADC_Type *base,
                              cadc_sample_slot_index_t eSampleIndex,
                              const cadc_sample_slot_config_t *psConfig)
{
    assert(NULL != psConfig);

