nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.c
    /* Sets the zero crossing mode for the selected sample slot. */
    CADC_SetSampleSlotZeroCrossingMode(base, eSampleIndex, psConfig->eZeroCrossingMode);

    /* Set limit value and offset value for the selected sample slot. */
    CADC_SetSampleSlotLowLimitValue(base, eSampleIndex, psConfig->u16LowLimitValue);
    CADC_SetSampleSlotHighLimitValue(base, eSampleIndex, psConfig->u16HighLimitValue);
    CADC_SetSampleSlotOffsetValue(base, eSampleIndex, psConfig->u16OffsetValue);
}

/*!
 * brief Sets zero crossing mode for each sample slot.
 *
 * param base CADC peripheral base address.
 * param eSampleIndex The index of sample slot.
 * param eZeroCrossingMode Zero crossing mode, please refer to @ref cadc_sample_slot_zero_crossing_mode_t for details.
 */
void CADC_SetSampleSlotZeroCrossingMode(ADC_Type *base,
                                        cadc_sample_slot_index_t eSampleIndex,
                                        cadc_sample_slot_zero_crossing_mode_t eZeroCrossingMode)
{
    uint16_t u16Tmp                          = 0U;
    volatile uint16_t *pZxctrlRegAddrArray[] = ADC_ZXCTRL_REG_ADDRESS_ARRAY;
    volatile uint16_t *pZxctrlRegPtr         = NULL;

    pZxctrlRegPtr = pZxctrlRegAddrArray[(uint16_t)eSampleIndex / 8U];
    if (pZxctrlRegPtr != NULL)
    {
        u16Tmp = (*pZxctrlRegPtr) & (uint16_t)(~ADC_ZXCTRL_ZCE_MASK((uint16_t)eSampleIndex & 7U));
        u16Tmp |= ADC_ZXCTRL_ZCE((uint16_t)eSampleIndex & 7U, eZeroCrossingMode);
        (*pZxctrlRegPtr) = u16Tmp;
    }
}

/*!
 * brief Routes the channel to the sample slot.
 *
 * param base CADC peripheral base address.
 * param eSampleIndex The index of sample slot. Please refer to @ref cadc_sample_slot_index_t for details.
 * param eChannelNumber Sample signal number, please refer to @ref cadc_channel_number_t for details.
 */
void CADC_RouteChannelToSampleSlot(ADC_Type *base,
                                   cadc_sample_slot_index_t eSampleIndex,
                                   cadc_channel_number_t eChannelNumber)
{
    volatile uint16_t *clistRegAddrArray[] = ADC_CLIST_REG_ADDRESS_ARRAY;
    volatile uint16_t *clistRegPtr         = NULL;
    uint16_t u16Tmp                        = 0U;

    /* Gets clist register address based on sampleIndex */
    clistRegPtr = clistRegAddrArray[(uint16_t)eSampleIndex / 4U];

    if (clistRegPtr != NULL)
    {
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
        if (clistRegPtr == CLIST5_ADDRESS)
        {
            assert(eChannelNumber > kCADC_SingleEndANB7_DiffANB6pANB7n);
            u16Tmp = (*clistRegPtr) & (uint16_t)(~(ADC_CLIST5_SAMPLE16_MASK << (2U * ((uint16_t)eSampleIndex & 7U))));
            u16Tmp |=
                (uint16_t)(((uint16_t)eChannelNumber & (ADC_RSLT_COUNT - 1U)) << (2U * ((uint16_t)eSampleIndex & 7U)));
            (*clistRegPtr) = u16Tmp;
        }
        else
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
        {
            if (eChannelNumber <= kCADC_SingleEndANB7_DiffANB6pANB7n)
            {
                u16Tmp = (*clistRegPtr) & (uint16_t)(~ADC_CLIST_SAMPLE_MASK((uint16_t)eSampleIndex & 3U));
                u16Tmp |= ADC_CLIST_SAMPLE((uint16_t)eSampleIndex & 3U, eChannelNumber);
                (*clistRegPtr) = u16Tmp;
            }
        }
    }
}

/*!
 * brief Configures the options(such as clock divisor, reference voltage source, and so on) of the converter.
 *
 * This function can be used to configure the converter
 * The operations are:
 *  - Set clock divisor;
 *  - Set reference voltage source
 *  - Enable/Disable DMA
 *  - Power-up/power-down converter
 *
 * param base          CADC peripheral base address.
 * param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * param psConfig        Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
void CADC_SetConverterConfig(ADC_Type *base, cadc_converter_id_t eConverterId, const cadc_converter_config_t *psConfig)
{
    assert(NULL != psConfig);

    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        CADC_SetConverterAConfig(base, psConfig);
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        CADC_SetConverterBConfig(base, psConfig);
    }
}

/*!
 * brief Gets available pre-defined settings(such as clock divisor, reference voltage source, and so on) for each
 * converter's configuration.
 *
 * This function initializes each converter's configuration structure with an available settings.
 * The default value are:
 * code
 *   psConfig->u16ClockDivisor = 4U; (ADC clock = Peripheral clock / 5)
 *   psConfig->eSpeedMode = kCADC_SpeedMode0; (Chip specific)
 *   psConfig->eHighReferenceVoltageSource = kCADC_ReferenceVoltageVrefPad;
 *   psConfig->eLowReferenceVoltageSource = kCADC_ReferenceVoltageVrefPad;
 *   psConfig->u16SampleWindowCount = 0U; (Chip specific)
 *   psConfig->bEnableDMA         = false;
 *   psConfig->bPowerUp   = false;
 *   psConfig->bScanInitBySync  = true;
 * endcode
 * param psConfig Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
void CADC_GetConverterDefaultConfig(cadc_converter_config_t *psConfig)
{
    assert(NULL != psConfig);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    /* The default values are from power up reset state. */
    psConfig->u16ClockDivisor = 4U;
#if !(defined(FSL_FEATURE_CADC_NO_SPEEDMODE_BIT) && FSL_FEATURE_CADC_NO_SPEEDMODE_BIT)
    psConfig->eSpeedMode = kCADC_SpeedMode0;
#endif /* FSL_FEATURE_CADC_NO_SPEEDMODE_BIT */
    psConfig->eHighReferenceVoltageSource = kCADC_ReferenceVoltageVrefPad;
    psConfig->eLowReferenceVoltageSource  = kCADC_ReferenceVoltageVrefPad;
#if !(defined(FSL_FEATURE_CADC_NO_SAMPLE_WINDOW) && FSL_FEATURE_CADC_NO_SAMPLE_WINDOW)
    psConfig->u16SampleWindowCount = 0U;
#endif /* FSL_FEATURE_CADC_NO_SAMPLE_WINDOW */
    psConfig->bEnableDMA      = false;
    psConfig->bPowerUp        = false;
    psConfig->bScanInitBySync = true;
}

/*!
 * brief Sets converter's reference voltage source(Including high reference voltage source and low reference voltage
 * source).
 *
 * param base CADC peripheral base address.
 * param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * param eHighReferenceVoltage High voltage reference source, please refer to @ref cadc_reference_voltage_source_t.
 * param eLowReferenceVoltage  Low voltage reference source, please refer to @ref cadc_reference_voltage_source_t.
 */
void CADC_SetConverterReferenceVoltageSource(ADC_Type *base,
                                             cadc_converter_id_t eConverterId,
                                             cadc_reference_voltage_source_t eHighReferenceVoltage,
                                             cadc_reference_voltage_source_t eLowReferenceVoltage)
{
    uint16_t u16Tmp;

    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        u16Tmp = base->CAL & ~(uint16_t)(ADC_CAL_SEL_VREFH_A_MASK | ADC_CAL_SEL_VREFLO_A_MASK);
        if (kCADC_ReferenceVoltageChannelPad == eHighReferenceVoltage)
        {
            u16Tmp |= ADC_CAL_SEL_VREFH_A_MASK;
        }
        if (kCADC_ReferenceVoltageChannelPad == eLowReferenceVoltage)
        {
            u16Tmp |= ADC_CAL_SEL_VREFLO_A_MASK;
        }
        base->CAL = u16Tmp;
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        u16Tmp = base->CAL & ~(uint16_t)(ADC_CAL_SEL_VREFH_B_MASK | ADC_CAL_SEL_VREFLO_B_MASK);
        if (kCADC_ReferenceVoltageChannelPad == eHighReferenceVoltage)
        {
            u16Tmp |= ADC_CAL_SEL_VREFH_B_MASK;
        }
        if (kCADC_ReferenceVoltageChannelPad == eLowReferenceVoltage)
        {
            u16Tmp |= ADC_CAL_SEL_VREFLO_B_MASK;
        }
        base->CAL = u16Tmp;
    }
}

/*!
 * brief Powers up/down the specific converter.
 *
 * This function is to enable the power for the converter. The converter should be powered up before the conversion.
 * Once this API is called to power up the converter, the converter would be powered on after a few moment (so-called
 * power up delay, the function CADC_SetPowerUpDelay() can be used to set the power up delay), so that the power would
 * be stable.
 *
 * param base          CADC peripheral base address.
 * param eConverterId The converter to be powered. See @ref cadc_converter_id_t.
 * param bEnable       Powers up/down the converter.
 *                      - \b true Power up the specific converter.
 *                      - \b false Power down the specific converter.
 */
void CADC_EnableConverterPower(ADC_Type *base, cadc_converter_id_t eConverterId, bool bEnable)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        if (bEnable)
        {
            base->PWR &= ~(uint16_t)ADC_PWR_PD0_MASK; /* Clear PowerDown to enable. */
            if ((base->PWR & ADC_PWR_APD_MASK) == 0U)
            {
                while ((base->PWR & ADC_PWR_PSTS0_MASK) != 0U)
                {
                }
            }
        }
        else
        {
            base->PWR |= ADC_PWR_PD0_MASK;
        }
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        if (bEnable)
        {
            base->PWR &= ~(uint16_t)ADC_PWR_PD1_MASK; /* Clear PowerDown to enable. */
            if ((base->PWR & ADC_PWR_APD_MASK) == 0U)
            {
                while ((base->PWR & ADC_PWR_PSTS1_MASK) != 0U)
                {
                }
            }
        }
        else
        {
            base->PWR |= ADC_PWR_PD1_MASK;
        }
    }
}
